# What and Why we are using Pandas?

### What is it?
- Pandas is Python library used for data manipulation and analysis

### Why we are using it?
- In think because its is very powerful :)))
- Here is what it can do:
    - import data from various formats (json, sql, xlxs,..)
    - manipulating data (cleaning, transforming, visualizing,...)
    - And much more...
    
<hr>

In [1]:
# First lets import pandas
import numpy as np
import pandas as pd

## Series
- A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

**Sound it like Numpy array?**
- One diferent things is that in Pandas Series we have axis labels, meaning that we can access data by indexed a label instead of a number location.

In [2]:
# you can convert a list, numpy array, dictionary to a Series
axis_label = ['a','b','c']
list1 = [100,200,300]
arr1 = np.array(list1)
diction1 = {
    'a':100,
    'b':200,
    'c':300
}

**List**

In [3]:
pd.Series(data=list1)

0    100
1    200
2    300
dtype: int64

In [4]:
pd.Series(data=list1, index=axis_label)

a    100
b    200
c    300
dtype: int64

**Numpy array**

In [5]:
pd.Series(arr1)

0    100
1    200
2    300
dtype: int32

In [6]:
pd.Series(arr1,axis_label)

a    100
b    200
c    300
dtype: int32

**Dictionary**

In [7]:
pd.Series(diction1)

a    100
b    200
c    300
dtype: int64

**Even function**

In [8]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [9]:
# you can take sum of 2 Series

ser1 = pd.Series(data=[1,2,3],index=['A','B','D'])
ser2 = pd.Series(data=[10,20,30],index=['A','B','C'])

ser1 + ser2 # it will take the sum of 2 index(axis_label) have the same name

A    11.0
B    22.0
C     NaN
D     NaN
dtype: float64

<hr>

## DataFrames
- That is just a bunch of Series that share the same index(axis_label)

In [10]:
df1 = pd.DataFrame(data = np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df1

          W         X         Y         Z
A  1.643332  0.547153 -0.054713 -0.190631
B  0.222492 -0.307541 -1.993886 -0.913932
C  1.255430 -0.037844  0.220835 -1.531389
D -0.449771 -0.272895 -0.077353  0.231396
E -0.753600  0.247827  0.488532 -2.689100

**Indexing and Selecting**

In [11]:
# Select column
df1['W']

A    1.643332
B    0.222492
C    1.255430
D   -0.449771
E   -0.753600
Name: W, dtype: float64

In [12]:
# Multiple columns
df1[['W','Z']]

          W         Z
A  1.643332 -0.190631
B  0.222492 -0.913932
C  1.255430 -1.531389
D -0.449771  0.231396
E -0.753600 -2.689100

In [13]:
# Select row
df1.loc['A'] # using label

W    1.643332
X    0.547153
Y   -0.054713
Z   -0.190631
Name: A, dtype: float64

In [14]:
# Select row
df1.iloc[0] # using index

W    1.643332
X    0.547153
Y   -0.054713
Z   -0.190631
Name: A, dtype: float64

In [15]:
# Select multiple row
df1.loc[['A','D']]

          W         X         Y         Z
A  1.643332  0.547153 -0.054713 -0.190631
D -0.449771 -0.272895 -0.077353  0.231396

In [16]:
# Create new row
df1.loc['newRow'] = df1.loc['A'] + df1.loc['D']
df1

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
D      -0.449771 -0.272895 -0.077353  0.231396
E      -0.753600  0.247827  0.488532 -2.689100
newRow  1.193561  0.274258 -0.132066  0.040766

In [17]:
# create new column
df1['newColumn'] = df1['W'] + df1['Z']
df1

               W         X         Y         Z  newColumn
A       1.643332  0.547153 -0.054713 -0.190631   1.452702
B       0.222492 -0.307541 -1.993886 -0.913932  -0.691440
C       1.255430 -0.037844  0.220835 -1.531389  -0.275959
D      -0.449771 -0.272895 -0.077353  0.231396  -0.218375
E      -0.753600  0.247827  0.488532 -2.689100  -3.442700
newRow  1.193561  0.274258 -0.132066  0.040766   1.234327

In [18]:
# Select both row and column
df1.loc[['A','B'],['W','Z']]

          W         Z
A  1.643332 -0.190631
B  0.222492 -0.913932

In [19]:
# remove column of df1
df1.drop('newColumn', axis=1) # axis=1 for column =0 for row

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
D      -0.449771 -0.272895 -0.077353  0.231396
E      -0.753600  0.247827  0.488532 -2.689100
newRow  1.193561  0.274258 -0.132066  0.040766

In [20]:
# but when you see df1 it does not remove in it
df1

               W         X         Y         Z  newColumn
A       1.643332  0.547153 -0.054713 -0.190631   1.452702
B       0.222492 -0.307541 -1.993886 -0.913932  -0.691440
C       1.255430 -0.037844  0.220835 -1.531389  -0.275959
D      -0.449771 -0.272895 -0.077353  0.231396  -0.218375
E      -0.753600  0.247827  0.488532 -2.689100  -3.442700
newRow  1.193561  0.274258 -0.132066  0.040766   1.234327

In [21]:
# Specific inplace parameter if you want to replace in the original
df1.drop('newColumn',axis=1,inplace=True)

In [22]:
df1 # it has been removed

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
D      -0.449771 -0.272895 -0.077353  0.231396
E      -0.753600  0.247827  0.488532 -2.689100
newRow  1.193561  0.274258 -0.132066  0.040766

In [23]:
# drop row
df1.drop('E') # in the default axis=0

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
D      -0.449771 -0.272895 -0.077353  0.231396
newRow  1.193561  0.274258 -0.132066  0.040766

**conditional selecting**

In [24]:
df1

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
D      -0.449771 -0.272895 -0.077353  0.231396
E      -0.753600  0.247827  0.488532 -2.689100
newRow  1.193561  0.274258 -0.132066  0.040766

In [25]:
df1 > 0

            W      X      Y      Z
A        True   True  False  False
B        True  False  False  False
C        True  False   True  False
D       False  False  False   True
E       False   True   True  False
newRow   True   True  False   True

In [26]:
df1[df1>0]

               W         X         Y         Z
A       1.643332  0.547153       NaN       NaN
B       0.222492       NaN       NaN       NaN
C       1.255430       NaN  0.220835       NaN
D            NaN       NaN       NaN  0.231396
E            NaN  0.247827  0.488532       NaN
newRow  1.193561  0.274258       NaN  0.040766

In [27]:
df1[df1['W']>0]

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
newRow  1.193561  0.274258 -0.132066  0.040766

In [28]:
df1[df1['W']>0][['Y','X']]

               Y         X
A      -0.054713  0.547153
B      -1.993886 -0.307541
C       0.220835 -0.037844
newRow -0.132066  0.274258

**reset and set index**

In [29]:
df1

               W         X         Y         Z
A       1.643332  0.547153 -0.054713 -0.190631
B       0.222492 -0.307541 -1.993886 -0.913932
C       1.255430 -0.037844  0.220835 -1.531389
D      -0.449771 -0.272895 -0.077353  0.231396
E      -0.753600  0.247827  0.488532 -2.689100
newRow  1.193561  0.274258 -0.132066  0.040766

In [30]:
df1.reset_index(inplace=True)
df1

    index         W         X         Y         Z
0       A  1.643332  0.547153 -0.054713 -0.190631
1       B  0.222492 -0.307541 -1.993886 -0.913932
2       C  1.255430 -0.037844  0.220835 -1.531389
3       D -0.449771 -0.272895 -0.077353  0.231396
4       E -0.753600  0.247827  0.488532 -2.689100
5  newRow  1.193561  0.274258 -0.132066  0.040766

In [31]:
df1['New index'] = 'Minh Long Yen Oanh Trinh Dontknow'.split()
df1

    index         W         X         Y         Z New index
0       A  1.643332  0.547153 -0.054713 -0.190631      Minh
1       B  0.222492 -0.307541 -1.993886 -0.913932      Long
2       C  1.255430 -0.037844  0.220835 -1.531389       Yen
3       D -0.449771 -0.272895 -0.077353  0.231396      Oanh
4       E -0.753600  0.247827  0.488532 -2.689100     Trinh
5  newRow  1.193561  0.274258 -0.132066  0.040766  Dontknow

In [32]:
df1

    index         W         X         Y         Z New index
0       A  1.643332  0.547153 -0.054713 -0.190631      Minh
1       B  0.222492 -0.307541 -1.993886 -0.913932      Long
2       C  1.255430 -0.037844  0.220835 -1.531389       Yen
3       D -0.449771 -0.272895 -0.077353  0.231396      Oanh
4       E -0.753600  0.247827  0.488532 -2.689100     Trinh
5  newRow  1.193561  0.274258 -0.132066  0.040766  Dontknow

In [33]:
df1.set_index('New index',inplace=True)
df1

            index         W         X         Y         Z
New index
Minh            A  1.643332  0.547153 -0.054713 -0.190631
Long            B  0.222492 -0.307541 -1.993886 -0.913932
Yen             C  1.255430 -0.037844  0.220835 -1.531389
Oanh            D -0.449771 -0.272895 -0.077353  0.231396
Trinh           E -0.753600  0.247827  0.488532 -2.689100
Dontknow   newRow  1.193561  0.274258 -0.132066  0.040766

<hr>

## Missing Data
- In real like we usually deal with some unusual data Pandas provide some method to solve it

In [34]:
df2 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [35]:
df2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
df2.dropna()

     A    B  C
0  1.0  5.0  1

In [37]:
df2.dropna(axis=1) # default is 0

   C
0  1
1  2
2  3

In [38]:
df2.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [39]:
df2.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [40]:
df2['A'].fillna(value=df2['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<hr>

## Operation on DataFrames

In [41]:
df3 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
df3['col2'].unique()

array([444, 555, 666], dtype=int64)

In [43]:
df3['col2'].nunique()

3

In [44]:
df3['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

**Selecting data**

In [45]:
newdf3 = df3[(df3['col1'] > 2) & (df3['col2']==444)]
newdf3

   col1  col2 col3
3     4   444  xyz

**Applying function into Dataframe**

In [46]:
# lets define simple function
def power2(x):
    return x**2

In [47]:
df4 = pd.DataFrame(np.arange(1,6))
df4

   0
0  1
1  2
2  3
3  4
4  5

In [48]:
df4.apply(power2)

    0
0   1
1   4
2   9
3  16
4  25

In [49]:
df4[2:4].apply(power2)

    0
2   9
3  16

In [50]:
df4.apply(power2).apply(len)

0    5
dtype: int64

In [51]:
df4.apply(power2).apply(sum)

0    55
dtype: int64

**get name of column and index**

In [52]:
df3

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
df3.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [54]:
df3.index

RangeIndex(start=0, stop=4, step=1)

In [55]:
df3.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [56]:
df3 # in default the inplace=False

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

**handling NaN value**

In [57]:
df5 = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df5

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [58]:
df5.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [59]:
df5.dropna()# inplace=False

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [60]:
df5

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [61]:
df5.fillna("FILL NaN VALUE")# inplace=False

             col1            col2 col3
0             1.0  FILL NaN VALUE  abc
1             2.0           555.0  def
2             3.0           666.0  ghi
3  FILL NaN VALUE           444.0  xyz

<hr>

## Read data from file and write data to file
- Pandas support a lot of format file for you to read and write

**CSV**

In [62]:
# reading from csv file
read1 = pd.read_csv('data/example')
read1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
read1 = read1[(read1 > 5) & (read1 < 10)]
read1

     a    b    c    d
0  NaN  NaN  NaN  NaN
1  NaN  NaN  6.0  7.0
2  8.0  9.0  NaN  NaN
3  NaN  NaN  NaN  NaN

In [64]:
# writing into file
read1.to_csv('data/write_example', index=False)

**Excel**

In [65]:
read2 = pd.read_excel('data/Excel_Sample.xlsx', sheet_name='Sheet1')
read2

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [66]:
read2.to_excel('data/Write_excel.xlsx', sheet_name="Sheet1")

**HTML**
- You may need to install these packages before we continue to read html file
    - `conda install lxml`
    - `conda install html5lib`
    - `conda install BeautifilSoup4`

In [67]:
from bs4 import BeautifulSoup

url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'

df = pd.read_html(url)
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"